CopyPasteMaster-CG/cw32l010/mcu_lib/src/cw32l052_adc.c
    return 0;
}

/**
 * @brief
 *          ADC禁用
 */
void ADC_Disable(void)
{
    REGBITS_CLR(CW_ADC->CR0, ADC_CR0_EN_Msk);
}

/**
 * @brief
 *          单通道转换模式公共配置
 *
 * @param   ADC_SingleChStruct
 */
void ADC_SingleChCommon(ADC_SingleChTypeDef *ADC_SingleChStruct)
{
    ASSERT(NULL != ADC_SingleChStruct)
    assert_param(IS_ADC_CH_SEL(ADC_SingleChStruct->ADC_Chmux ));
    assert_param(IS_ADC_DATA_DISCARD(ADC_SingleChStruct->ADC_DiscardEn ));

    ADC_Init(&ADC_SingleChStruct->ADC_InitStruct);
    ADC_SetSingleCh(ADC_SingleChStruct->ADC_Chmux);
    if (ADC_SingleChStruct->ADC_WdtStruct.ADC_WdtAll == ADC_WdtEnable)
    {
        ADC_WdtConfig(&ADC_SingleChStruct->ADC_WdtStruct);
    }

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DISCARD_Msk | ADC_CR1_CHMUX_Msk,
                   ADC_SingleChStruct->ADC_DiscardEn |\
                   ADC_SingleChStruct->ADC_Chmux);
}

/**
 * @brief
 *        ADC单通道单次转换模式配置
 *
 * @param ADC_SingleChStruct
 */
void ADC_SingleChOneModeCfg(ADC_SingleChTypeDef *ADC_SingleChStruct)
{
    ADC_SingleChCommon(ADC_SingleChStruct);
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SingleChOneMode);
}

/**
 * @brief
 *        ADC单通道多次转换模式配置
 *
 * @param ADC_SingleChStruct
 * @param cntAdcSample: 0 ~ 255
 */
void ADC_SingleChMoreModeCfg(ADC_SingleChTypeDef *ADC_SingleChStruct,
                             uint8_t cntAdcSample)
{
    ADC_SingleChStruct->ADC_InitStruct.ADC_AccEn = ADC_AccEnable; //Must be added

    ADC_SingleChCommon(ADC_SingleChStruct);
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SingleChMoreMode);
    CW_ADC->CR2_f.CNT = cntAdcSample;
}

/**
 * @brief
 *        ADC单通道连续转换模式配置
 *
 * @param ADC_SingleChStruct
 */
void ADC_SingleChContinuousModeCfg(ADC_SingleChTypeDef *ADC_SingleChStruct)
{
    ADC_SingleChCommon(ADC_SingleChStruct);
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SingleChContinuousMode);
}

/**
 * @brief
 *        ADC序列转换模式公共配置
 *
 * @param ADC_SerialChStruct
 */
void ADC_SerialChCommon(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    if (NULL == ADC_SerialChStruct)
    {
        return;
    }

    ADC_Init(&ADC_SerialChStruct->ADC_InitStruct);

    switch (ADC_SerialChStruct->ADC_SqrEns)
    {
        case ADC_SqrEns0:
            ADC_Sqr0ChannelCfg(ADC_SerialChStruct);
            break;
        case ADC_SqrEns01:
            ADC_Sqr01ChannelCfg(ADC_SerialChStruct);
            break;
        case ADC_SqrEns02:
            ADC_Sqr02ChannelCfg(ADC_SerialChStruct);
            break;
        case ADC_SqrEns03:
            ADC_Sqr03ChannelCfg(ADC_SerialChStruct);
            break;
        case ADC_SqrEns04:
            ADC_Sqr04ChannelCfg(ADC_SerialChStruct);
            break;
        case ADC_SqrEns05:
            ADC_Sqr05ChannelCfg(ADC_SerialChStruct);
            break;
        case ADC_SqrEns06:
            ADC_Sqr06ChannelCfg(ADC_SerialChStruct);
            break;
        case ADC_SqrEns07:
            ADC_Sqr07ChannelCfg(ADC_SerialChStruct);
            break;

        default:
            break;
    }

}

/**
 * @brief
 *        ADC序列连续转换模式配置
 *
 * @param ADC_SerialChStruct
 */
void ADC_SerialChContinuousModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ADC_SerialChCommon(ADC_SerialChStruct);
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChContinuousMode);
}

/**
 * @brief
 *        ADC序列扫描转换模式配置
 *
 * @param ADC_SerialChStruct
 */
void ADC_SerialChScanModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ADC_SerialChCommon(ADC_SerialChStruct);
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChScanMode);
}

/**
 * @brief
 *        ADC序列多次转换模式配置
 *
 * @param ADC_SerialChStruct
 * @param cntAdcSample: 0 ~ 255
 */
void ADC_SerialChMoreModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct,
                             uint8_t cntAdcSample)
{
    ADC_SerialChStruct->ADC_InitStruct.ADC_AccEn = ADC_AccEnable; //Must be added

    ADC_SerialChCommon(ADC_SerialChStruct);
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChMoreMode);

    CW_ADC->CR2_f.CNT = cntAdcSample;
}

/**
 * @brief
 *        ADC序列断续转换模式配置
 *
 * @param ADC_SerialChStruct
 */
void ADC_SerialChBreakModeCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ADC_SerialChCommon(ADC_SerialChStruct);
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_MODE_Msk, ADC_SerialChBreakMode);
}

/**
 * @brief
 *          设置单通道采样通道，如果使用了VDDA/3、BGR_TS、Vref1P2
 *          则自动打开内部增益开关、使用BGR_TS自动打开温度传感器
 *
 * @param   enAdcSampCh:
 *          @arg ADC_ExInputCH0
 *          @arg ADC_ExInputCH1
 *          @arg ADC_ExInputCH2
 *          @arg ADC_ExInputCH3
 *          @arg ADC_ExInputCH4
 *          @arg ADC_ExInputCH5
 *          @arg ADC_ExInputCH6
 *          @arg ADC_ExInputCH7
 *          @arg ADC_ExInputCH8
 *          @arg ADC_ExInputCH9
 *          @arg ADC_ExInputCH10
 *          @arg ADC_ExInputCH11
 *          @arg ADC_ExInputCH12
 *          @arg ADC_VddaDiV3Input
 *          @arg ADC_TsInput
 *          @arg ADC_Vref1P2Input
 */
void ADC_SetSingleCh(uint32_t enAdcSampCh)
{
    assert_param(IS_ADC_CH_SEL(enAdcSampCh));
    if ((enAdcSampCh == ADC_VddaDiV3Input) || (enAdcSampCh == ADC_TsInput)
            || (enAdcSampCh == ADC_Vref1P2Input))
    {
        REGBITS_SET(CW_ADC->CR0, ADC_CR0_BUF_Msk);
    }

    //如果ADC通道选择了内置温度传感器输出电压，则需要使能内置温度传感器
    if (enAdcSampCh == ADC_TsInput)
    {
        //使能内置温度传感器
        REGBITS_SET(CW_ADC->CR0, ADC_CR0_TSEN_Msk);
    }
    CW_ADC->CR1_f.CHMUX = enAdcSampCh;
}

/**
 * @brief
 *          设置序列采样通道，如果使用了VDDA/3、BGR_TS、Vref1P2
 *          则自动打开内部增益开关、使用BGR_TS自动打开温度传感器
 *
 * @param enAdcSampCh:
 *        @arg ADC_SqrCh0
 *        @arg ADC_SqrCh1
 *        @arg ADC_SqrCh2
 *        @arg ADC_SqrCh3
 *        @arg ADC_SqrCh4
 *        @arg ADC_SqrCh5
 *        @arg ADC_SqrCh6
 *        @arg ADC_SqrCh7
 *        @arg ADC_SqrCh8
 *        @arg ADC_SqrCh9
 *        @arg ADC_SqrCh10
 *        @arg ADC_SqrCh11
 *        @arg ADC_SqrCh12
 *        @arg ADC_SqrVddaDiV3
 *        @arg ADC_SqrTs
 *        @arg ADC_SqrVref1P2
 */
void ADC_SetSerialCh(uint32_t enAdcSampCh)
{
    assert_param(IS_ADC_SQR_CH(enAdcSampCh));
    if ((enAdcSampCh == ADC_SqrVddaDiV3) || (enAdcSampCh == ADC_SqrTs)
            || (enAdcSampCh == ADC_SqrVref1P2))
    {
        REGBITS_SET(CW_ADC->CR0, ADC_CR0_BUF_Msk);
    }

    //如果ADC通道选择了内置温度传感器输出电压，则需要使能内置温度传感器
    if (enAdcSampCh == ADC_SqrTs)
    {
        //使能内置温度传感器
        REGBITS_SET(CW_ADC->CR0, ADC_CR0_TSEN_Msk);
    }
    
