CopyPasteMaster-CG/cw32l010/mcu_lib/src/cw32l052_adc.c
}

/**
 * @brief
 *        读取ADC参考电压1.5V时的温度传感器的测量温度
 *
 * @param fAdcTsDegree
 */
void ADC_GetTsVref1V5(float *fAdcTsDegree)
{
    uint16_t u16AdcResult;
    uint8_t temp1;
    uint16_t temp2;
    temp1 = *((uint8_t*) (ADDR_T0));
    temp2 = *((uint16_t*) (ADDR_TRIM_1P5));
    /*Caution: Must select ADC_GetSqr0Result()~ADC_GetSqr7Result() instead of ADC_GetConversionValue() if using ADC_SQR convertion.
    * ADC single channel convertion is default.
    */
    u16AdcResult = ADC_GetConversionValue();
    //ADC_GetSqr0Result(&u16AdcResult); //Using ADC_SQR0.
    //ADC_GetSqr1Result(&u16AdcResult); //Using ADC_SQR1.
    //ADC_GetSqr2Result(&u16AdcResult); //Using ADC_SQR2.
    //ADC_GetSqr3Result(&u16AdcResult); //Using ADC_SQR3.
    //ADC_GetSqr4Result(&u16AdcResult); //Using ADC_SQR4.
    //ADC_GetSqr5Result(&u16AdcResult); //Using ADC_SQR5.
    //ADC_GetSqr6Result(&u16AdcResult); //Using ADC_SQR6.
    //ADC_GetSqr7Result(&u16AdcResult); //Using ADC_SQR7.
    *fAdcTsDegree = temp1 * 0.5f + COEFF_TS * 1.5f * (u16AdcResult - temp2);
}

/**
 * @brief
 *        读取ADC参考电压2.5V时的温度传感器的测量温度
 *
 * @param fAdcTsDegree
 */
void ADC_GetTsVref2V5(float *fAdcTsDegree)
{
    uint16_t u16AdcResult;
    uint8_t temp1;
    uint16_t temp2;
    temp1 = *((uint8_t*) (ADDR_T0));
    temp2 = *((uint16_t*) (ADDR_TRIM_2P5));
    /*Caution: Must select ADC_GetSqr0Result()~ADC_GetSqr7Result() instead of ADC_GetConversionValue() if using ADC_SQR convertion.
    * ADC single channel convertion is default.
    */
    u16AdcResult = ADC_GetConversionValue();
    //ADC_GetSqr0Result(&u16AdcResult); //Using ADC_SQR0.
    //ADC_GetSqr1Result(&u16AdcResult); //Using ADC_SQR1.
    //ADC_GetSqr2Result(&u16AdcResult); //Using ADC_SQR2.
    //ADC_GetSqr3Result(&u16AdcResult); //Using ADC_SQR3.
    //ADC_GetSqr4Result(&u16AdcResult); //Using ADC_SQR4.
    //ADC_GetSqr5Result(&u16AdcResult); //Using ADC_SQR5.
    //ADC_GetSqr6Result(&u16AdcResult); //Using ADC_SQR6.
    //ADC_GetSqr7Result(&u16AdcResult); //Using ADC_SQR7.
    *fAdcTsDegree = temp1 * 0.5f + COEFF_TS * 2.5f * (u16AdcResult - temp2);
}

/**
 * @brief
 *          ADC自动停止配置
 *
 * @param   enAutoStop:
 *          @arg ADC_AutoStopDisable
 *          @arg ADC_AutoStopEnable
 */
void ADC_AutoStop(uint32_t enAutoStop)
{
    REGBITS_MODIFY(CW_ADC->START, ADC_START_AUTOSTOP_Msk, enAutoStop);
}

/**
 * @brief
 *          ADC中断配置
 *
 * @param   ADC_IT:
 *          @arg ADC_IT_READY
 *          @arg ADC_IT_OVW
 *          @arg ADC_IT_WDTR
 *          @arg ADC_IT_WDTH
 *          @arg ADC_IT_WDTL
 *          @arg ADC_IT_EOA
 *          @arg ADC_IT_EOS
 *          @arg ADC_IT_EOC
 * @param   NewState:
 *          @arg DISABLE
 *          @arg ENABLE
 */
void ADC_ITConfig(uint16_t ADC_IT, FunctionalState NewState)
{
    uint8_t itMask = 0;
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_ADC_IT(ADC_IT));
    /* Get the ADC IT index */
    itMask = (uint8_t) ADC_IT;
    if (NewState != DISABLE)
    {
        /* Enable the selected ADC interrupts */
        CW_ADC->IER |= itMask;
    }
    else
    {
        /* Disable the selected ADC interrupts */
        CW_ADC->IER &= (~(uint32_t) itMask);
    }
}

/**
 * @brief
 *          使能NVIC中ADC中断
 *
 * @param   intPriority:
 *          @arg 0 ~ 3
 */
void ADC_EnableNvic(uint8_t intPriority)
{
    if (intPriority < (1UL << __NVIC_PRIO_BITS))
    {
        NVIC_ClearPendingIRQ(ADC_IRQn);
        NVIC_EnableIRQ(ADC_IRQn);
        NVIC_SetPriority(ADC_IRQn, intPriority);
    }
}

/**
 * @brief
 *          禁用NVIC中ADC中断
 *
 * @param
 *
 */
void ADC_DisableNvic(void)
{
    NVIC_ClearPendingIRQ(ADC_IRQn);
    NVIC_DisableIRQ(ADC_IRQn);
    NVIC_SetPriority(ADC_IRQn, ADC_INT_PRIORITY);
}

/**
 * @brief
 *        ADC逐通道依次转换的通道使能配置
 *
 * @param ADC_AltrChmux:
 *        @arg ADC_AltrCh0      
 *        @arg ADC_AltrCh1      
 *        @arg ADC_AltrCh2      
 *        @arg ADC_AltrCh3      
 *        @arg ADC_AltrCh4      
 *        @arg ADC_AltrCh5      
 *        @arg ADC_AltrCh6      
 *        @arg ADC_AltrCh7      
 *        @arg ADC_AltrCh8      
 *        @arg ADC_AltrCh9      
 *        @arg ADC_AltrCh10     
 *        @arg ADC_AltrCh11     
 *        @arg ADC_AltrCh12     
 *        @arg ADC_AltrVddaDiV3 
 *        @arg ADC_AltrTs       
 *        @arg ADC_AltrVref1P2  
 * @param NewState:
 *        @arg DISABLE
 *        @arg ENABLE
 */
void ADC_AltrChannelCfg(uint16_t ADC_TRIG, FunctionalState NewState)
{
    uint16_t trigMask = 0;
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_ADC_TRIG(ADC_TRIG));
    /* Get the ADC TRIG index */
    trigMask = ADC_TRIG;
    if (NewState != DISABLE)
    {
        /* Enable the selected ADC interrupts */
        CW_ADC->TRIGGER |= trigMask;
    }
    else
    {
        /* Disable the selected ADC interrupts */
        CW_ADC->TRIGGER &= (~(uint32_t) trigMask);
    }
}
//@} // AdcGroup

/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

